Revit 2027 API
PanelScheduleTemplate.IsValidType Method
Overload List
Name | Description
IsValidType(ElementId) |  Checks if given type is valid for this element.
IsValidType(PanelScheduleType) |  Checks if given type is valid for this panel schedule template element.
Top
See Also
Reference
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace